{
  "Part 0": {
    "title": "Requirements",
    "problems": [
      [
        {
          "yes": "You have provided your README file and your implementation is accessible. ",
          "no": "You did not provide a README file and/but your implementation is not accessible.",
          "point": 5
        },
        {
          "yes": "You have provided a READ ONLY link to Overleaf for your project report.",
          "no": "You did not provide a READ ONLY link to Overleaf for your project report.",
          "point": 1
        },
        {
          "yes": "You have provided the exact commit hash for your GitHub.",
          "no": "You did not provide commit hash for your GitHub for us to consider. Please make sure to add your GitHub commit hash for your upcoming assignments.",
          "point": 1
        },
        {
          "yes": "You have used proper reference style in your report.",
          "no": "You did not follow the proper reference style for your report. You could have consistently follow either APA, MLA or IEEE reference style.",
          "point": 1
        },
        {
          "yes": "Your graphs/figures are readable. Good job!",
          "no": "Your figures/graphs are not readable, it requires us to zoom while we are trying to read the graphs/figures.",
          "point": 1
        },
        {
          "yes": "Great job! Your report met the page limit requirement. Keep up the concise and focused writing.",
          "no": "Your report exceeded the 8-page limit. For future reports, please aim to keep it within the required length by focusing on key points and being concise.",
          "point": 1
        }
      ]
    ]
  },
  "Part 1": {
    "title": "Hypothesis",
    "problems": [
      [
        {
          "yes": "You clearly stated an explicit hypothesis, helping to establish a focused narrative for the report. Your approach ensures clarity and direction, making the analysis more structured and purposeful.",
          "no": "You needed to explain how you decided about your hypotheses. In other words, how did you come to derive your hypotheses?",
          "point": 2
        },
        {
          "yes": "You build your hypothesis using evidence.",
          "no": "Your hypothesis is not grounded by evidence. You should have provided explicit evidence and ground your hypothesis around those.",
          "point": 2
        },
        {
          "yes": "You followed up with the hypothesis in your discussion/conclusion.",
          "no": "You cannot just state a hypothesis since it needs to follow through from a narrative perspective at the end of your report.",
          "point": 2
        },
        {
          "yes": "You have provided direct evidence to support whether your hypothesis has been met.",
          "no": "You didn't provide direct evidence to support whether your hypothesis has been met.",
          "point": 2
        }
      ]
    ]
  },
  "Part 2": {
    "title": "DO-RHC",
    "problems": [
      [
        {
          "yes": "You successfully explained how RHC performs relative to problem characteristics and addressed how it handles local optima. Your analysis demonstrates a clear understanding of the topic.",
          "no": "Your report did not fully explain how RHC performs relative to problem characteristics or how it handles local optima. In future work, please provide a more detailed discussion on these aspects to meet the requirement.",
          "point": 3
        },
        {
          "yes": "You effectively presented a plot/table of RHC performance over iterations and provided a clear explanation of the observed trends. Your analysis enhances the understanding of RHC's behavior.",
          "no": "Your report is missing a plot or table of RHC performance over iterations and/or an explanation of observed trends. Please include these elements in future reports to fully meet the requirement.",
          "point": 3
        },
        {
          "yes": "You successfully presented a plot/table comparing RHC performance at different problem sizes. The comparison is clear and provides valuable insights into how problem size impacts performance.",
          "no": "Your report is missing a plot or table comparing RHC performance at different problem sizes. Please include this in future reports to provide a complete analysis of how problem size affects performance.",
          "point": 2
        },
        {
          "yes": "You provided a clear discussion of RHC's stopping criteria and convergence speed, along with an insightful explanation of the risk of getting stuck in local optima. Your analysis effectively covers the required aspects.",
          "no": "Your report did not fully discuss RHC's stopping criteria, convergence speed, or the risk of getting stuck in local optima. Please ensure these aspects are addressed in future reports for a more complete analysis.",
          "point": 3
        },
        {
          "yes": "You clearly explained the tuning, modifications, or enhancements made to RHC. Your discussion provides valuable insights into how these changes impact performance.",
          "no": "Your report does not include a discussion of any tuning, modifications, or enhancements made to RHC. Please address this in future reports to fully meet the requirement.",
          "point": 2
        }
      ]
    ]
  },
  "Part 3": {
    "title": "DO-SA",
    "problems": [
      [
        {
          "yes": "You successfully explained how SA performs relative to problem characteristics and addressed how it handles local optima. Your analysis demonstrates a clear understanding of the topic.",
          "no": "Your report did not fully explain how SA performs relative to problem characteristics or how it handles local optima. In future work, please provide a more detailed discussion on these aspects to meet the requirement.",
          "point": 3
        },
        {
          "yes": "You effectively presented a plot/table of SA performance over iterations and provided a clear explanation of the observed trends. Your analysis enhances the understanding of SA's behavior.",
          "no": "Your report is missing a plot or table of SA performance over iterations and/or an explanation of observed trends. Please include these elements in future reports to fully meet the requirement.",
          "point": 3
        },
        {
          "yes": "You successfully presented a plot/table comparing SA performance at different problem sizes. The comparison is clear and provides valuable insights into how problem size impacts performance.",
          "no": "Your report is missing a plot or table comparing SA performance at different problem sizes. Please include this in future reports to provide a complete analysis of how problem size affects performance.",
          "point": 2
        },
        {
          "yes": "You provided a clear discussion of SA's stopping criteria and convergence speed, along with an insightful explanation of the risk of getting stuck in local optima. Your analysis effectively covers the required aspects.",
          "no": "Your report did not fully discuss SA's stopping criteria, convergence speed, or the risk of getting stuck in local optima. Please ensure these aspects are addressed in future reports for a more complete analysis.",
          "point": 3
        },
        {
          "yes": "You clearly explained the tuning, modifications, or enhancements made to SA. Your discussion provides valuable insights into how these changes impact performance.",
          "no": "Your report does not include a discussion of any tuning, modifications, or enhancements made to SA. Please address this in future reports to fully meet the requirement.",
          "point": 2
        }
      ]
    ]
  },
  "Part 4": {
    "title": "DO-GA",
    "problems": [
      [
        {
          "yes": "You successfully explained how GA performs relative to problem characteristics and addressed how it handles local optima. Your analysis demonstrates a clear understanding of the topic.",
          "no": "Your report did not fully explain how GA performs relative to problem characteristics or how it handles local optima. In future work, please provide a more detailed discussion on these aspects to meet the requirement.",
          "point": 3
        },
        {
          "yes": "You effectively presented a plot/table of GA performance over iterations and provided a clear explanation of the observed trends. Your analysis enhances the understanding of GA's behavior.",
          "no": "Your report is missing a plot or table of GA performance over iterations and/or an explanation of observed trends. Please include these elements in future reports to fully meet the requirement.",
          "point": 3
        },
        {
          "yes": "You successfully presented a plot/table comparing GA performance at different problem sizes. The comparison is clear and provides valuable insights into how problem size impacts performance.",
          "no": "Your report is missing a plot or table comparing GA performance at different problem sizes. Please include this in future reports to provide a complete analysis of how problem size affects performance.",
          "point": 2
        },
        {
          "yes": "You provided a clear discussion of GA's stopping criteria and convergence speed, along with an insightful explanation of the risk of getting stuck in local optima. Your analysis effectively covers the required aspects.",
          "no": "Your report did not fully discuss GA's stopping criteria, convergence speed, or the risk of getting stuck in local optima. Please ensure these aspects are addressed in future reports for a more complete analysis.",
          "point": 3
        },
        {
          "yes": "You clearly explained the tuning, modifications, or enhancements made to GA. Your discussion provides valuable insights into how these changes impact performance.",
          "no": "Your report does not include a discussion of any tuning, modifications, or enhancements made to GA. Please address this in future reports to fully meet the requirement.",
          "point": 2
        }
      ]
    ]
  },
  "Part 5": {
    "title": "WOP-RHC",
    "problems": [
      [
        {
          "yes": "You effectively explained convergence and demonstrated performance vs. iterations. Your analysis connects the results back to the problem structure, including algorithm and data, and provides a solid comparison between RHC and other RO approaches like SA and GA. Well done!",
          "no": "Your report is missing one or more key aspects: explanation of convergence with performance vs. iterations, connection to the problem structure (algorithm and data), or a comparison of RHC to other RO approaches (e.g., SA, GA). Please ensure these elements are included in future reports for a more comprehensive analysis.",
          "point": 6
        },
        {
          "yes": "You provided a thorough analysis of hyperparameters and their impact on RHC's behavior. Additionally, your hypotheses for improvements, including further tuning, modifying RHC behavior, or incorporating domain knowledge, were well thought out and insightful.",
          "no": "Your report lacks a detailed analysis of hyperparameters and their impact on RHC's behavior. Additionally, hypotheses for potential improvements, such as further tuning, modifying RHC, or adjusting the problem structure, are missing or underdeveloped. Please include these aspects in future reports for a more complete evaluation..",
          "point": 4
        },
        {
          "yes": "You provided a clear comparison of performance and time between backpropagation and RHC. Additionally, your explanation of why one approach outperformed the other was well-reasoned and supported by analysis.",
          "no": "Your report is missing a comparison of performance and time between backpropagation and RHC and/or an explanation of why one performed better. Please include these aspects in future reports for a complete evaluation. Your report does not include backpropagation results, which are required for comparison. Please ensure these results are included in future reports to meet the requirement.",
          "point": 3
        }
      ]
    ]
  },
  "Part 6": {
    "title": "WOP-GA",
    "problems": [
      [
        {
          "yes": "You effectively explained convergence and demonstrated performance vs. iterations. Your analysis connects the results back to the problem structure, including algorithm and data, and provides a solid comparison between GA and other RO approaches like SA and RHC. Well done!",
          "no": "Your report is missing one or more key aspects: explanation of convergence with performance vs. iterations, connection to the problem structure (algorithm and data), or a comparison of GA to other RO approaches (e.g., SA, RHC). Please ensure these elements are included in future reports for a more comprehensive analysis.",
          "point": 6
        },
        {
          "yes": "You provided a thorough analysis of hyperparameters and their impact on GA's behavior. Additionally, your hypotheses for improvements, including further tuning, modifying GA behavior, or incorporating domain knowledge, were well thought out and insightful.",
          "no": "Your report lacks a detailed analysis of hyperparameters and their impact on GA's behavior. Additionally, hypotheses for potential improvements, such as further tuning, modifying GA, or adjusting the problem structure, are missing or underdeveloped. Please include these aspects in future reports for a more complete evaluation..",
          "point": 4
        },
        {
          "yes": "You provided a clear comparison of performance and time between backpropagation and GA. Additionally, your explanation of why one approach outperformed the other was well-reasoned and supported by analysis.",
          "no": "Your report is missing a comparison of performance and time between backpropagation and GA and/or an explanation of why one performed better. Please include these aspects in future reports for a complete evaluation. Your report does not include backpropagation results, which are required for comparison. Please ensure these results are included in future reports to meet the requirement.",
          "point": 3
        }
      ]
    ]
  },
  "Part 7": {
    "title": "WOP-SA",
    "problems": [
      [
        {
          "yes": "You effectively explained convergence and demonstrated performance vs. iterations. Your analysis connects the results back to the problem structure, including algorithm and data, and provides a solid comparison between SA and other RO approaches like RHC and GA. Well done!",
          "no": "Your report is missing one or more key aspects: explanation of convergence with performance vs. iterations, connection to the problem structure (algorithm and data), or a comparison of SA to other RO approaches (e.g., RHC, GA). Please ensure these elements are included in future reports for a more comprehensive analysis.",
          "point": 6
        },
        {
          "yes": "You provided a thorough analysis of hyperparameters and their impact on SA's behavior. Additionally, your hypotheses for improvements, including further tuning, modifying SA behavior, or incorporating domain knowledge, were well thought out and insightful.",
          "no": "Your report lacks a detailed analysis of hyperparameters and their impact on SA's behavior. Additionally, hypotheses for potential improvements, such as further tuning, modifying SA, or adjusting the problem structure, are missing or underdeveloped. Please include these aspects in future reports for a more complete evaluation..",
          "point": 4
        },
        {
          "yes": "You provided a clear comparison of performance and time between backpropagation and SA. Additionally, your explanation of why one approach outperformed the other was well-reasoned and supported by analysis.",
          "no": "Your report is missing a comparison of performance and time between backpropagation and SA and/or an explanation of why one performed better. Please include these aspects in future reports for a complete evaluation. Your report does not include backpropagation results, which are required for comparison. Please ensure these results are included in future reports to meet the requirement.",
          "point": 3
        }
      ]
    ]
  },
  "Part 8": {
    "title": "Conclusion",
    "problems": [
      [
        {
          "yes": "You clearly identified the best-performing algorithm with strong justification. ",
          "no": "Your report lacks a clear identification of the best-performing algorithm and/or a strong justification for your choice.",
          "point": 1
        },
        {
          "yes": "Your discussion of computational trade-offs, such as wall clock time and convergence rate, was well-explained.",
          "no": "Additionally, the discussion of computational trade-offs (e.g., wall clock time, convergence rate) could be expanded.",
          "point": 1
        },
        {
          "yes": "You have discussed which algorithm performed best and why. You have shown wall clock times, trade-offs discussion.",
          "no": "Your discussion on conclusion is good, but you could have also discussed more on Type I and Type II errors.",
          "point": 1
        },
        {
          "yes": "Additionally, your insights demonstrated a deep understanding of the results, and your mention of theoretical implications added valuable context to your analysis. Well done!",
          "no": "Consider providing deeper insights into the results, and if possible, incorporating theoretical implications for a more comprehensive analysis.",
          "point": 1
        }
      ]
    ]
  },
  "Part 9": {
    "title": "EC",
    "problems": [
      [
        {
          "yes": "You have implemented and discussed the results of Evolutionary Strategies (ES).",
          "no": "Did not implement Evolutionary Strategies (ES).",
          "point": 5
        }
      ]
    ]
  }
}