{
    "Part 0": {
        "title": "Implementation",
        "problems": [
            {
                "yes": "Your README file is present and code for implementation is accessible.",
                "no": "You did not provide README file and your code is not accessisible",
                "point": 5
            },
            {
                "yes": "You provided a READ ONLY link to Overleaf using your submission",
                "no": "You did not provide READ ONLY link to your Overleaf report",
                "point": 5
            }
        ]
    },
    "Part 1": {
        "title": "Problem Description",
        "problems": [
            {
                "yes": "You provided information about two dataset.",
                "no": "You did not provided detailed information about two datasets. It was required that two datasets were chosen for this assignment. ",
                "point": 2
            },
            {
                "yes": "You described how each dataset is interesting from an ML prespective. ",
                "no": "You needed to describe each dataset in detail (especially why they were interesting from and ML prespective).",
                "point": 2
            },
            {
                "yes": "You described the underlying structure of each problems (sample sizes; number of features; class imbalance; data type: continuous and categorical; presence of noise)",
                "no": "You did not describe the underlying structure of each problem. We wanted to know: sample sizes; number of features; class imbalance; data type: continuous and categorical; presence of noise.",
                "point": 2
            },
            {
                "yes": "You explained why your datasets may produce different results when run against the same set of ML algorithms",
                "no": "You did not explain why your datasets may produce different results when run against the same set of ML algorithms",
                "point": 6
            }
        ]
    },
    "Part 2": {
        "title": "Problem Analysis (NN)",
        "problems": [
            {
                "yes": "You provided some discussion on learing complexity (LC) ",
                "no": "You needed to provide some discussion on learing complexity (LC) ",
                "point": 8
            },
            {
                "yes": "You aded model complexity",
                "no": "You needed to provide some discussion on model complexity",
                "point": 8
            },
            {
                "yes": "You also provided some plots",
                "no": "Your report lacks on plots from your analysis",
                "point": 8
            }
        ]
    },
    "Part 3": {
        "title": "Problem Analysis (SVM)",
        "problems": [
            {
                "yes": "You provided some discussion on learing complexity (LC) ",
                "no": "You needed to provide some discussion on learing complexity (LC) ",
                "point": 8
            },
            {
                "yes": "You aded model complexity",
                "no": "You needed to provide some discussion on model complexity",
                "point": 8
            },
            {
                "yes": "You also provided some plots",
                "no": "Your report lacks on plots from your analysis",
                "point": 8
            }
        ]
    },
    "Part 4": {
        "title": "Problem Analysis (KNN)",
        "problems": [
            {
                "yes": "You provided some discussion on learing complexity (LC) ",
                "no": "You needed to provide some discussion on learing complexity (LC) ",
                "point": 8
            },
            {
                "yes": "You aded model complexity",
                "no": "You needed to provide some discussion on model complexity",
                "point": 8
            },
            {
                "yes": "You also provided some plots",
                "no": "Your report lacks on plots from your analysis",
                "point": 8
            }
        ]
    },
    "Part 5": {
        "title": "Conclusion",
        "problems": [
            {
                "yes": "You provided some conclusions based on your observations (considered datasets; accuracy; time and space comlexities; features). Also applied broad ideas from leatures (cross-validation; mean absolute error; mean squared errors; overfitting and  underfitting; bias and variance trade-off)",
                "no": "You did not provide detailed conclusions based on your observations. In your conclusions you could have considered accuracy; time and space comlexities; features. Also tie them back with broad ideas from leatures (cross-validation; mean absolute error; mean squared errors; overfitting and  underfitting; bias and variance trade-off).",
                "point": 6
            }
        ]
    }
}